<?php
  header('content-type:text/html; charset=utf-8');

  // php 中数据类型
  // (1) 简单数据类型: 整数, 浮点数(小数), bool类型, 字符串类型, null
  // (2) 复杂数据类型: 数组  对象   函数


  // 1. 整数, 浮点数(小数)
  // $num = 123;
  // $pi = 3.1415926;
  // $pi = 4;
  // echo $num + $pi;

  // 2. bool 类型, true, false
  //    echo 在对于 bool 类型进行输出时, 
  //    如果是 true, 输出 1, 如果是 false, 输出 空字符串
  // $flag = true;
  // $flag = false;
  // $flag = false;
  // echo $flag;

  // 3. 字符串类型
  //    (1) 单双引号都可以进行字符串赋值
  //    (2) 字符串拼接不是 +, 而是 . (ps: . 是拼接符, 数字和数字也可以拼接, 最后返回字符串)
  //    (3) 双引号会进行解析变量, 要用空格隔开; ps: $name = '张三' => $str = "大家好, 我叫 '$name'"; => 大家好, 我叫'张三'; => 先解析变量, 之后再加上外面套的单引号
  //    (4) 单引号的性能好 (了解)
  //    (5) 注意单双引号嵌套问题

  // $str1 = "小红";
  // $str2 = '小兰';
  // echo $str1 . $str2 . "在一起玩";

  // $name = '社会我鹏哥';
  // echo "<h1>$str 人横话不多 </h1>  <br>";
  // echo '$str 人横话不多';

?>