<?php
  header('content-type:text/html;charset=utf-8');
  // 输出语句, 输出到浏览器, 最后交由浏览器解析
  // 1. echo 只能输出简单数据类型    (对bool类型 true=>1, false=>"")
  // 2. print_r( $arr );  打印复杂数据类型
  // 3. var_dump( $arr ); 输出变量的详细信息 (变量的类型以及长度) 
  // ps: null 要用var_dump才能输出, var_dump对布尔类型输出的是true, false

  // php 中, utf-8 编码的, 一个中文, 占3个字节


  // 数组
  // 1. 索引数组 (js中的数组很类似)
  //    (1) 通过下标存储数据
  //    (2) 获取数组长度  => count( $arr )  专门用于获取数组的长度
  //    (3) 取值和赋值通过下标

  // $arr = array("张三", "李四", "王五", "赵六", "田七", "王八");

  // $arr = [ "张三", "李四", "王五", "赵六", "田七", "王八" ];
  // print_r( $arr );
  // echo $arr[2];
  // echo count( $arr );


  // 2. 关联数组 (js中的对象很类似)
  //    (1) 通过键值对存储数据, 键值对连接符 =>
  //    (2) 通过 count 统计数组长度
  //	(3) 取值和赋值通过['key']

  // $arr = array(
  //   'name' => '张翠花',
  //   'age' => 18
  // );
  // $arr = [
  //   'name' => '张翠花',
  //   'age' => 18
  // ];
  // print_r( $arr );
  
  // 输出关联数组如下: 
  // Array ( [name] => 张翠花 [age] => 18 )


  // echo count( $arr );


  // 3. 二维数组 (数组里的元素是数组)
  //    应用: 一维关联数组, 可以存储一个人的信息
  //          二维数组, 可以存储一个班的信息

  // var arr = [
  //   [ 0, 1, 2, 3, 4, ],
  //   [ 5, 6, 7, 8, 9 ],
  // ];

  // $arr = [
  //   [ 0, 1, 2, 3, 4,],
  //   [ 5, 6, 7, 8, 9 ]
  // ];
  // echo $arr[0][1];
  

  $info = [
    'name' => '张翠花',
    'age' => 18
  ];

  $infos = [
    [
      'name' => '张翠花1',
      'age' => 18
    ],
    [
      'name' => '张翠花2',
      'age' => 18
    ],
    [
      'name' => '张翠花3',
      'age' => 18
    ],
    [
      'name' => '张翠花4',
      'age' => 18
    ]
  ];

  $infos = [
    'zs' => [
      'name' => '张三',
      'age' => 18
    ],
    'ls' => [
      'name' => '李四',
      'age' => 14
    ]
  ];

  
  echo $infos[1]['name'];

?>