<?php
  // max(),min() 分别返回一组数的最大值及最小值；
  // abs() 返回绝对值。
  // floor() 向下取整。
  // ceil() 向上取整。
  // round() 四舍五入。  round(-2.6) => -3
  // rand() 返回随机数，可以取到两端的值。 

  // // 通过传值调用
  // echo max( 1, 2, 3 );
  // // 支持直接传数组
  // echo max( [1, 111, 325] );

  // echo abs( -1 );    // 1
  // echo floor( 2.7 ); // 2
  // echo ceil( 2.7 );  // 3
  // echo round( 2.7 ); // 3


  // 输出 10 开始 到 100结束里面的随机整数, 包括 10 和 100
  // echo rand( 10, 100 );

  // 可以得到 995 到 1000 的随机整数, 包括两端的值
  // echo rand(995, 1000);

?>