<!--
  一个单文件组件, 就是vue中的一个组件, 是一个局部组件, 包含三个部分 template, script, style
  组件如何使用, vue实例如何使用, 在单文件中就如何使用
  各个组件互相独立, 数据不共享, 互不影响; 一个组件多次复用, 多次复用的组件之间也是互相独立, 数据不共享, 互不影响的
-->
<template>
  <!-- 模板 (该组件页面部分)
          template里放模板部分, 相当于组件中的视图, 用来展示页面的
          最外层必须要有 且 只能有 一个根标签
          不能为空
          该组件实例的管理范围为本组件的模板, 在模板中可以使用所有vue特性, 也拥有所有的vue特性, 比如数据驱动, 双向绑定, 自动渲染等等. 
   -->
  <div>
    <h1>这是第一个 单文件组件 -- {{ msg }}</h1>
  </div>
</template>

<script>
// JS逻辑代码  (该组件逻辑部分)
// script标签内可以为空
export default {
  // 里面类似于vue组件中的js部分, 包含有data, methods, computed, .. 等等
  // 作用范围为本组件的模板部分
  // 各个组件之间的数据是独立的
  data() {
    // 和组件一样, 返回一个新的对象
    return {
      msg: 'msg'
    }
  }
}
</script>

<style>
/* 样式 (该组件css部分)
   写css代码, 可以什么都不写 为空
   scoped:
   给 `style` 标签添加 `scoped` 属性以后，样式只会对当前组件中的结构(template模板)生效，而不会影响到其他组件, 样式在其他组件中不生效
  如果不添加scoped, 则添加的样式会影响到其他组件, 样式在其他组件中也会生效

  原理: 给当前组件中每个自动标签加了个data-md5编码标签属性, 将来解析样式的时候会在选择器中自动加一个属性选择器来选择md5该属性, 然后才加css
       原理了解即可, 不用我们做任何操作, 将来webpack打包的时候帮我们操作

  加scoped和不加scoped, 修改elementui的组件中的标签样式, 都生效.

  element-ui 提供的每个标签, 都是一个组件,

  element-ui标签组件将来会被element-ui自动编译, 编译成普通标签, 然后将编译后的标签展示到页面上 (我们不需要关心编译的问题)

  ★ 修改element-ui标签组件的样式, 建议修改element-ui标签组件编译后, 页面生成的具体标签的样式

  element-ui组件标签, 也可以看作是一个标签, 也可以给组件标签添加类名, 属性等. 将来通过查看具体编译后的结果, 再对具体编译后的生成的标签进行添加样式操作

  element-ui组件标签添加类名class, 将来会在编译后生成的具体标签上添加对应类名, 然后就可以通过这个类名给编译生成的具体标签添加样式了

  element-ui标签可以和普通标签一起混合, 嵌套, 并列使用, element-ui标签需要编译后展示, 普通标签直接展示, 并且编译时会保持混合, 嵌套, 并列关系

  element-ui标签可以嵌套, 并列普通标签, 也可以嵌套 并列 element-ui标签, 普通标签也可以嵌套 并列 element-ui标签和普通标签, 并且将来编译的时候会保持标签的嵌套  并列 关系

  可以把element-ui标签就当作标签来使用

  lang:
  给 `style` 标签添加 `lang="less"` 后，在style标签里就可以使用 less 语法了
  但是需要自己安装：`npm i -D less less-loader`, 配置项vue-cli在创建的时候已经帮我们配置好了

 */
h1 {
  color: green;
}
</style>
